#include "defs.h"

/* ========================== 地址描述结构 ========================== */
u32                    RAMSize            = 0;    // 系统内存大小
u32                    MemoryEntryCount   = 0;    // 描述符数量
AddressRangeDescriptor ARDs[10]           = {};   // 描述符结构体

/* ========================== 全局描述符表 ========================== */
u8                     gdtPtr[6]          = {};   // 全局描述符表指针
Descriptor             gdt[GDT_SIZE]      = {};   // 全局描述符表

/* ========================== 中断向量表 ========================== */
u8                     idtPtr[6]          = {};   // 中断向量表指针
Gate                   idt[IDT_SIZE]      = {};   // 中断向量表

/* ========================== 进程表 ========================== */
ProcessControlBlock    process[MAX_TASKS] = {};   // 进程表

/* ========================== TSS ========================== */
TSS                    tss;
